jlvandusen/Z-ClassControlSystem/firmware/ESP32_DOME_RC4/ESP32_DOME_RC4.ino

// ============================================================
//  ESP32_DOME_RC4 — dome node: 5 NeoPixel groups + ESP-NOW to the drive,
//  and (RC4.4) the USB<->ESP-NOW console bridge used by 'bb8 monitor ball'.
//
//  Builds on the STOCK esp32:esp32 core (3.x). NOT the Bluepad32 core: it
//  boots BTstack for sketches that never use BT, which starved this radio
//  into 89-94 % ESP-NOW loss and made WiFi.setSleep(false) an abort().
//  ESP-NOW callback signatures are version-guarded for core 2.x / 3.x.
//
//  RC4.4  stock core + WiFi.setSleep(false) (98/98 delivery); console
//         tunnel (TunnelCmd/TunnelOut, retry on NACK, keepalive).
//  RC4.5  lights per the reference look: PSI white speech-pulse while a
//         track plays (isplaying via drive), blue scrolling logic bars
//         (LOGIC_PIXELS), solid blue HP, eye unchanged. RED/BLUE/IDLE
//         anims painted on change (the old per-loop clear fought the PSI).
// ============================================================
#include <Adafruit_NeoPixel.h>
#include <esp_now.h>
#include <WiFi.h>
#include "esp_wifi.h"
#include "esp_sleep.h"

#include <Preferences.h>
#include "BuildStamp.h"
#include "PsiEnvelopes.h"   // RC4.6: per-track 25 Hz amplitude envelopes (generated)
Preferences prefs;

// ---------------- CONFIG ----------------

#define psiPIN     25
#define sLogicPIN  27
#define lLogicPIN  33
#define hpPIN      15
#define eyePIN     32
#define battPin    A13 // GPIO35

// RC4.7: pixel counts are RUNTIME-CONFIGURABLE (a strip may be a single RGB
// LED, a ring, or a bar). Strips are built at MAX_PIXELS capacity and shrunk
// to the configured count with updateLength() at boot; `leds <strip> <n>` saves
// and applies live. These #defines are only the DEFAULTS / initial counts.
#define NUM_PIXELS 1
#define LOGIC_PIXELS 4
#define MAX_PIXELS 60    // hard cap per strip (buffer allocation)
#define BRIGHTNESS 64

// live counts (loaded from NVS "leds" namespace)
int nPsi = NUM_PIXELS, nLogic = LOGIC_PIXELS, nHp = NUM_PIXELS, nEye = NUM_PIXELS;
bool ledTestActive = false;   // 'ledtest' count-discovery mode holds the LEDs

#define WIFI_CHANNEL 11
#define HEARTBEAT_LED 2  // Built-in LED on many ESP32 boards

// ESPNOW peer MAC
uint8_t masterMAC[] = {0xC4, 0x5B, 0xBE, 0x90, 0x6A, 0x68};

// ------------------- CONFIGURABLE DEFAULTS -------------------
static const char* DEFAULT_REVISION = "Joe Drive Rev 1.0 RC4 DOME";
static const char* DEFAULT_REVISION_DATE = "2026-08-20";

const unsigned long SHOW_AFTER_MS = 5000;

bool shownAfterWait = false;
unsigned long bootMs = 0;

#pragma pack(push, 1)
typedef struct struct_message {

  int psi;          // Flicker flag
  int anim;         // Animation code
  float bat;        // Battery voltage

  uint16_t checksum = 0;
} struct_message;
#pragma pack(pop)

struct_message incoming;
struct_message outgoing;

// Built at MAX_PIXELS; updateLength() shrinks each to its configured count at boot.
Adafruit_NeoPixel PSI(MAX_PIXELS, psiPIN, NEO_GRB + NEO_KHZ800);
Adafruit_NeoPixel sLOGIC(MAX_PIXELS, sLogicPIN, NEO_GRB + NEO_KHZ800);
Adafruit_NeoPixel lLOGIC(MAX_PIXELS, lLogicPIN, NEO_GRB + NEO_KHZ800);
Adafruit_NeoPixel HP(MAX_PIXELS, hpPIN, NEO_RGB + NEO_KHZ800);
Adafruit_NeoPixel EYE(MAX_PIXELS, eyePIN, NEO_GRB + NEO_KHZ800);

bool debugLocal = false;

// RC4.7: per-strip pixel counts, runtime-configurable + NVS-persisted.
void loadLedCounts() {
  prefs.begin("dome", true);
  nPsi   = prefs.getInt("lpsi", nPsi);
  nLogic = prefs.getInt("llog", nLogic);
  nHp    = prefs.getInt("lhp",  nHp);
  nEye   = prefs.getInt("leye", nEye);
  prefs.end();
}
void saveLedCounts() {
  prefs.begin("dome", false);
  prefs.putInt("lpsi", nPsi);
  prefs.putInt("llog", nLogic);
  prefs.putInt("lhp",  nHp);
  prefs.putInt("leye", nEye);
  prefs.end();
}
void applyLedCounts() {
  nPsi = constrain(nPsi, 1, MAX_PIXELS);   nLogic = constrain(nLogic, 1, MAX_PIXELS);
  nHp  = constrain(nHp, 1, MAX_PIXELS);    nEye   = constrain(nEye, 1, MAX_PIXELS);
  PSI.updateLength(nPsi); sLOGIC.updateLength(nLogic); lLOGIC.updateLength(nLogic);
  HP.updateLength(nHp);   EYE.updateLength(nEye);
  PSI.setBrightness(255);                  // PSI at full (boot-feedback look)
  sLOGIC.setBrightness(BRIGHTNESS); lLOGIC.setBrightness(BRIGHTNESS);
  HP.setBrightness(BRIGHTNESS);     EYE.setBrightness(BRIGHTNESS);
  PSI.clear(); sLOGIC.clear(); lLOGIC.clear(); HP.clear(); EYE.clear();
  PSI.show(); sLOGIC.show(); lLOGIC.show(); HP.show(); EYE.show();
}
void ledsShow() {
  Serial.printf("[LEDS] psi=%d logic=%d(x2 bars) hp=%d eye=%d (max %d each)\n",
                nPsi, nLogic, nHp, nEye, MAX_PIXELS);
}

// Timers
unsigned long lastEyeUpdate = 0;
unsigned long lastLogicUpdate = 0;
unsigned long lastRainbowUpdate = 0;
unsigned long flickerEndTime = 0;
unsigned long lastDataTime = 0;
unsigned long lastBatteryUpdate = 0;

bool shouldFlicker = false;

// Sleep logic
RTC_DATA_ATTR bool wake = true;
const unsigned long SLEEP_TIMEOUT = 15UL * 60UL * 1000UL; // 15 min
const unsigned long BATTERY_INTERVAL = 5UL * 60UL * 1000UL; // 5 min

// Animation state machine. 0-3 are the original tints (PSI only); 4-7 are the
// RC4.7 D-pad LIGHT SCENES (full takeover of eye/HP/PSI/logic) latched from the
// pads: UP=ALERT, DOWN=SCANNER, LEFT=FIRE, RIGHT=PARTY.
enum AnimState { IDLE, RAINBOW, RED, BLUE, SCENE_ALERT, SCENE_SCANNER, SCENE_FIRE, SCENE_PARTY };
AnimState currentAnim = IDLE;
void renderScene(unsigned long ms);

// RC4.7: runtime pixel-count config (prototypes; defs after the strip globals)
void loadLedCounts();
void saveLedCounts();
void applyLedCounts();
void ledsShow();

// Serial command buffer
String cmdBuffer = "";

// === Function Prototypes ===
// RC4.3: the dome now builds on the STOCK esp32 core (no Bluepad32) — the
// Bluepad32 core boots BTstack even for sketches that never use BT, which
// (a) contended the radio into 89-94% ESP-NOW loss and (b) made
// WiFi.setSleep(false) an abort(). Core 3.x changed the recv callback
// signature; both are supported here.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
void OnDataRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len);
#else
void OnDataRecv(const uint8_t *mac, const uint8_t *data, int len);
#endif
// void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status);
void checkSerialCommand();
void updateAnimations();
void handleAnimation();
void rainbowCycle();
void sendBattery();
float readBatteryVoltage();
uint16_t calculateChecksum(const struct_message &d);
void bootFeedback();

// RC4.7 dashboard state (functions live below, past the tunnel section)
#include <WebServer.h>
WebServer webServer(80);
bool webOn = false;
char webLog[1401];
uint16_t webLogLen = 0;
void startWeb();
void stopWeb();
void webLogAppend(const char* s, uint8_t n);

void setup() {
  Serial.begin(115200);
  unsigned long start = millis();
  while (!Serial && millis() - start < 2000) {
      ; // Wait max 2 seconds for Serial
  }
  Serial.println(F("\n=== Dome ESP32 Boot ==="));
  Serial.println(F("Instructions:"));
  Serial.println(F("1. Ensure Drive Master MAC is correct in masterMAC[]"));
  Serial.println(F("2. Type 'debug' to toggle local debug"));
  Serial.println(F("3. Device will sleep after 15 min inactivity"));
  Serial.println(F("--------------------------------------------"));

  bootMs = millis();
  // Display right after reboot (every boot)
  showBuildInfoSerial("BOOT");

  prefs.begin("dome", false);

