jlvandusen/Z-ClassControlSystem/firmware/ESP32_DOME_RC4/ESP32_DOME_RC4.ino
  // Load MAC from prefs if available
  String savedMAC = prefs.getString("masterMAC", "");
  if (savedMAC.length() == 17) { // Valid MAC format
    Serial.printf("[MAC] Loaded saved Drive Master MAC: %s\n", savedMAC.c_str());
    parseMAC(savedMAC, masterMAC);
  } else {
    Serial.println("[MAC] Using default Drive Master MAC");
  }

  pinMode(battPin, INPUT);  // RC4: GPIO35 is input-only — it has no internal pull-up

  // Boot LED feedback
  bootFeedback();

  // Wake-up cause
  if (esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_EXT0) {
    wake = !wake;
    Serial.printf("[WAKE] Button pressed. New state: %s\n", wake ? "AWAKE" : "SLEEP");
  }
  if (!wake) {
    Serial.println("[SLEEP] Going back to sleep...");
    esp_sleep_enable_ext0_wakeup(GPIO_NUM_35, 0);
    esp_deep_sleep_start();
  }

  WiFi.mode(WIFI_STA);
  // RC4.3: WiFi modem sleep is ON by default in STA mode and the receiver
  // naps between AP beacons it isn't even associated to — measured 89-94%
  // ESP-NOW loss (no MAC ACK) on the bench until this line. The dome's
  // radio has no BT to share with, so keep it awake permanently.
  WiFi.setSleep(false);
  esp_wifi_set_channel(WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE);

  uint8_t mac[6];
  WiFi.macAddress(mac);   // core-3.x-safe (esp_read_mac needs esp_mac.h there)
  Serial.printf("[MAC] Dome WiFi STA MAC: %02X:%02X:%02X:%02X:%02X:%02X\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  if (esp_now_init() != ESP_OK) {
    Serial.println(F("[ESPNOW] Init Failed"));
    return;
  }
  esp_now_register_recv_cb(OnDataRecv);
  esp_now_register_send_cb(OnDataSent);   // RC4.4: tunnel retry needs the ACK

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, masterMAC, 6);
  peerInfo.channel = WIFI_CHANNEL;
  peerInfo.encrypt = false;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    Serial.println(F("[ESPNOW] Failed to add Drive peer"));
  } else {
    Serial.println(F("[ESPNOW] Connected to Drive ESP32"));
  }

  PSI.begin(); sLOGIC.begin(); lLOGIC.begin(); HP.begin(); EYE.begin();
  loadLedCounts();     // RC4.7: per-strip pixel counts from NVS
  applyLedCounts();    // updateLength + brightness + clear + show

  Serial.println(F("[READY] Dome ready"));

  // RC4.7: the phone dashboard survives reboots ('web on' / 'web off')
  webOn = prefs.getBool("webon", false);
  if (webOn) startWeb();

  lastDataTime = millis();
  lastBatteryUpdate = millis();
}

void loop() {
  checkSerialCommand();
  serviceTunnelRetry();
  if (webOn) webServer.handleClient();
  updateAnimations();
  handleAnimation();

  // Display after waiting (once)
  if (!shownAfterWait && (millis() - bootMs) >= SHOW_AFTER_MS) {
    shownAfterWait = true;
    showBuildInfoSerial("AFTER WAIT");
  }

  // RC4: battery telemetry to the drive (was declared but never sent)
  if (millis() - lastBatteryUpdate >= BATTERY_INTERVAL) {
    lastBatteryUpdate = millis();
    sendBattery();
  }

  // Inactivity sleep (suppressed while the web dashboard is up)
  if (!webOn && millis() - lastDataTime > SLEEP_TIMEOUT) {
    Serial.println("[TIMEOUT] No data for 15 mins. Sleeping...");
    esp_sleep_enable_ext0_wakeup(GPIO_NUM_35, 0);
    esp_deep_sleep_start();
  }
}


bool parseMAC(const String &macStr, uint8_t *macArray) {
  int values[6];
  if (sscanf(macStr.c_str(), "%x:%x:%x:%x:%x:%x",
             &values[0], &values[1], &values[2],
             &values[3], &values[4], &values[5]) == 6) {
    for (int i = 0; i < 6; i++) macArray[i] = (uint8_t)values[i];
    return true;
  }
  return false;
}


// ============ RC4.4: bb8 <-> drive console tunnel over ESP-NOW ============
// This dome (on USB at the PC) is a transparent bridge: any console line
// that is not a dome-local command (help/version/debug/setmac) is sent to
// the drive as a TunnelCmd; the drive mirrors its whole console back as
// TunnelOut packets which are written raw to USB. While bb8 is attached
// (USB activity in the last 10 min) a keepalive TunnelCmd goes out every
// 15 s so the drive keeps its mirror armed. Structs hand-mirrored from
// ESP32_DRIVE_RC4.ino — sizes are the discriminator.
struct __attribute__((packed)) TunnelCmd { uint8_t type, seq, len; char data[180]; uint16_t checksum; };
struct __attribute__((packed)) TunnelOut { uint8_t type, seq, len; char data[236]; uint16_t checksum; };
static const uint8_t TUNNEL_CMD_TYPE = 0xC1, TUNNEL_OUT_TYPE = 0xC2;
static uint16_t tunnelSumBytes(const void *p, size_t n) {
  const uint8_t *b = (const uint8_t *)p; uint16_t s = 0;
  for (size_t i = 0; i + 2 < n; i++) s += b[i];
  return s;
}
#define tunnelSum(pkt) tunnelSumBytes(&(pkt), sizeof(pkt))
TunnelCmd gTunTx;                     // last command sent (kept for retry)
uint8_t gTunSeq = 0, gTunAttempts = 0;
volatile bool gTunAwaitAck = false, gTunResend = false;
unsigned long lastUsbMs = 0, lastPingMs = 0, gTunSentMs = 0;

// RC4.7: OTA relay — bb8 sends "OTAD <seq> <base64>" lines over USB, we decode
// and forward them to the drive as binary TunnelOta packets (struct mirrored
// from ESP32_DRIVE_RC4.ino; size is the discriminator). The drive's acks come
// back as ordinary console lines through the TunnelOut mirror.
struct __attribute__((packed)) TunnelOta { uint8_t type; uint32_t seq; uint8_t len; uint8_t data[192]; uint16_t checksum; };
static const uint8_t TUNNEL_OTA_TYPE = 0xC3;
TunnelOta gOtaTx;
uint8_t gOtaAttempts = 0;
volatile bool gOtaAwaitAck = false, gOtaResend = false;
unsigned long gOtaSentMs = 0, gOtaActiveMs = 0;

static int b64val(char c) {
  if (c >= 'A' && c <= 'Z') return c - 'A';
  if (c >= 'a' && c <= 'z') return c - 'a' + 26;
  if (c >= '0' && c <= '9') return c - '0' + 52;
  if (c == '+') return 62;
  if (c == '/') return 63;
  return -1;
}
static int b64decode(const char* in, int inLen, uint8_t* out, int outMax) {
  int n = 0, acc = 0, bits = 0;
  for (int i = 0; i < inLen; i++) {
    if (in[i] == '=') break;
    int v = b64val(in[i]);
    if (v < 0) return -1;
    acc = (acc << 6) | v;
    bits += 6;
    if (bits >= 8) {
      bits -= 8;
      if (n >= outMax) return -1;
      out[n++] = (uint8_t)((acc >> bits) & 0xFF);
    }
  }
  return n;
}

