jlvandusen/Z-ClassControlSystem/firmware/ESP32_DOME_RC4/ESP32_DOME_RC4.ino
void handleOtaLine(const String& raw) {           // "OTAD <seq> <base64>"
  int sp1 = raw.indexOf(' '), sp2 = raw.indexOf(' ', sp1 + 1);
  if (sp1 < 0 || sp2 < 0) { Serial.println(F("[OTAERR] bad line")); return; }
  uint32_t seq = strtoul(raw.substring(sp1 + 1, sp2).c_str(), nullptr, 10);
  int n = b64decode(raw.c_str() + sp2 + 1, raw.length() - sp2 - 1, gOtaTx.data, sizeof(gOtaTx.data));
  if (n <= 0) { Serial.println(F("[OTAERR] bad b64")); return; }
  gOtaTx.type = TUNNEL_OTA_TYPE;
  gOtaTx.seq = seq;
  gOtaTx.len = (uint8_t)n;
  gOtaTx.checksum = tunnelSum(gOtaTx);
  gOtaAttempts = 1; gOtaAwaitAck = true; gOtaSentMs = millis(); gOtaActiveMs = millis();
  esp_now_send(masterMAC, (uint8_t*)&gOtaTx, sizeof(gOtaTx));
}

void sendTunnelCmd(const String &line) {
  gTunTx.type = TUNNEL_CMD_TYPE;
  gTunTx.seq = ++gTunSeq; if (gTunSeq == 0) gTunTx.seq = gTunSeq = 1;
  gTunTx.len = (uint8_t)min((unsigned int)line.length(), (unsigned int)sizeof(gTunTx.data));
  memcpy(gTunTx.data, line.c_str(), gTunTx.len);
  gTunTx.checksum = tunnelSum(gTunTx);
  gTunAttempts = 1; gTunAwaitAck = true; gTunSentMs = millis();
  esp_now_send(masterMAC, (uint8_t *)&gTunTx, sizeof(gTunTx));
}
void serviceTunnelRetry() {          // called from loop(); resend on NACK, max 6 tries 40 ms apart
  if (gTunResend && gTunAttempts < 6 && millis() - gTunSentMs >= 40) {
    gTunResend = false; gTunAttempts++; gTunAwaitAck = true; gTunSentMs = millis();
    esp_now_send(masterMAC, (uint8_t *)&gTunTx, sizeof(gTunTx));
  }
  // RC4.7: OTA chunk NACK retry (bb8's line-level timeout is the backstop)
  if (gOtaResend && gOtaAttempts < 8 && millis() - gOtaSentMs >= 30) {
    gOtaResend = false; gOtaAttempts++; gOtaAwaitAck = true; gOtaSentMs = millis();
    esp_now_send(masterMAC, (uint8_t *)&gOtaTx, sizeof(gOtaTx));
  }
  // keepalive while bb8 is attached so the drive keeps mirroring
  // (suppressed while an OTA transfer is streaming — the chunks arm it)
  if (millis() - gOtaActiveMs >= 3000UL &&
      millis() - lastUsbMs < 600000UL && millis() - lastPingMs >= 15000UL) {
    lastPingMs = millis();
    if (!gTunAwaitAck) sendTunnelCmd("");
  }
}
// ==========================================================================

// ============ RC4.7: phone dashboard (softAP + tiny web server) ============
// 'web on' (dome console, persisted) raises an access point "ZClass-Dome"
// (pass zclassbb8) on the ESP-NOW channel; http://192.168.4.1 shows link/
// battery status, the drive's mirrored console, and a command box that
// injects through the tunnel — the phone becomes a wireless drive console.
// Costs battery and defeats the inactivity sleep — turn it off for shows.
// (globals live up top so setup()/loop() can see them)
float readBatteryVoltage();

void webLogAppend(const char* s, uint8_t n) {
  if (!webOn || n == 0) return;
  if (webLogLen + n >= sizeof(webLog) - 1) {       // keep the newest half
    uint16_t keep = (sizeof(webLog) - 1) / 2;
    memmove(webLog, webLog + webLogLen - keep, keep);
    webLogLen = keep;
  }
  memcpy(webLog + webLogLen, s, n);
  webLogLen += n;
  webLog[webLogLen] = 0;
}

static const char WEB_PAGE[] PROGMEM = R"HTML(<!doctype html><html><head><meta name=viewport content="width=device-width,initial-scale=1"><title>Z-Class Dome</title>
<style>body{font:16px system-ui;background:#101418;color:#e6e6e6;margin:16px}h1{font-size:18px;margin:0 0 6px}
#s{color:#9aa5b1;margin:8px 0}pre{background:#161b21;border:1px solid #232a33;padding:8px;height:45vh;overflow:auto;font-size:12px;white-space:pre-wrap}
input{width:68%;padding:8px;background:#161b21;color:#e6e6e6;border:1px solid #232a33}button{padding:8px 14px}</style></head><body>
<h1>Z-Class &mdash; dome dashboard</h1><div id=s>connecting&hellip;</div><pre id=l></pre>
<form onsubmit="send();return false"><input id=c placeholder="drive console command (ver, pid show, macro run 1...)"><button>send</button></form>
<script>
async function tick(){try{const r=await(await fetch('/status')).json();
document.getElementById('s').textContent='dome battery '+r.domebat.toFixed(2)+' V · drive link '+(r.link_ms<3000?'LIVE':'stale '+Math.round(r.link_ms/1000)+'s')+' · track '+r.track+' · anim '+r.anim;
const t=await(await fetch('/log')).text();const p=document.getElementById('l');if(p.textContent!==t){p.textContent=t;p.scrollTop=p.scrollHeight;}}catch(e){}}
setInterval(tick,1000);tick();
async function send(){const c=document.getElementById('c');await fetch('/cmd',{method:'POST',body:new URLSearchParams({c:c.value})});c.value='';}
</script></body></html>)HTML";

void startWeb() {
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP("ZClass-Dome", "zclassbb8", WIFI_CHANNEL);   // same channel keeps ESP-NOW alive
  WiFi.setSleep(false);
  webServer.on("/", []() {
    webServer.send_P(200, "text/html", WEB_PAGE);
  });
  webServer.on("/status", []() {
    char j[128];
    snprintf(j, sizeof(j), "{\"domebat\":%.2f,\"link_ms\":%lu,\"track\":%d,\"anim\":%d}",
             readBatteryVoltage(), (unsigned long)(millis() - lastDataTime),
             (int)incoming.psi, (int)incoming.anim);
    webServer.send(200, "application/json", j);
  });
  webServer.on("/log", []() { webServer.send(200, "text/plain", webLog); });
  webServer.on("/cmd", HTTP_POST, []() {
    String c = webServer.arg("c");
    c.trim();
    if (c.length() > 0 && c.length() < 170) { sendTunnelCmd(c); webServer.send(200, "text/plain", "sent"); }
    else webServer.send(400, "text/plain", "bad command");
  });
  webServer.begin();
  webLog[0] = 0; webLogLen = 0;
  Serial.println(F("[WEB] dashboard ON — AP 'ZClass-Dome' (pass zclassbb8), http://192.168.4.1"));
  Serial.println(F("[WEB] note: inactivity sleep is disabled while the dashboard is on"));
}

void stopWeb() {
  webServer.stop();
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  Serial.println(F("[WEB] dashboard OFF"));
}
// ==========================================================================

// === Functions ===
void checkSerialCommand() {
  while (Serial.available()) {
    char c = Serial.read();
    lastUsbMs = millis();
    if (c == '\n') {
      cmdBuffer.trim();
      String rawLine = cmdBuffer;          // RC4.4: preserve case for the tunnel
      bool local = false;
      // RC4.7: OTA data line from bb8 — decode + relay as binary, never tunnel as text
      if (rawLine.startsWith("OTAD ")) { local = true; handleOtaLine(rawLine); }
      cmdBuffer.toLowerCase();
      if (cmdBuffer == "version") {
        local = true;
        showBuildInfoSerial("VERSION");
      }
      if (cmdBuffer == "debug") {
        local = true;
        debugLocal = !debugLocal;
        Serial.println(debugLocal ? F("Dome local debug ENABLED") : F("Dome local debug DISABLED"));
      }
    if (cmdBuffer.startsWith("setmac")) {
      local = true;
      String macStr = cmdBuffer.substring(6);
      macStr.trim();
      if (parseMAC(macStr, masterMAC)) {
        prefs.putString("masterMAC", macStr);
        Serial.printf("[MAC] New MAC saved: %s\n", macStr.c_str());
      } else {
        Serial.println("[ERROR] Invalid MAC format. Use XX:XX:XX:XX:XX:XX");
      }
    }
    if (cmdBuffer == "web on" || cmdBuffer == "web off") {
      local = true;
      bool want = cmdBuffer.endsWith("on");
      if (want != webOn) {
        webOn = want;
        prefs.putBool("webon", webOn);
        if (webOn) startWeb(); else stopWeb();
      } else Serial.println(webOn ? F("[WEB] already on") : F("[WEB] already off"));
    }
    if (cmdBuffer.startsWith("ledtest")) {
      local = true;
      String s = cmdBuffer.substring(7); s.trim();
      // Light EVERY physical LED on a circle (strip run at MAX) so you can
      // count them, then 'leds <strip> <count>'. 'ledtest off' restores.
      Adafruit_NeoPixel* strip = (s == "psi") ? &PSI : (s == "logic") ? &sLOGIC
                               : (s == "hp") ? &HP : (s == "eye") ? &EYE : nullptr;
      if (s == "off" || s.length() == 0) {
        ledTestActive = false; applyLedCounts();
        Serial.println(F("[LEDTEST] off — counts restored"));
      } else if (strip) {
        ledTestActive = true;
        PSI.clear(); sLOGIC.clear(); lLOGIC.clear(); HP.clear(); EYE.clear();
        PSI.show(); sLOGIC.show(); lLOGIC.show(); HP.show(); EYE.show();
        strip->updateLength(MAX_PIXELS);
        for (int i = 0; i < MAX_PIXELS; i++) strip->setPixelColor(i, strip->Color(60, 60, 60));
        strip->show();
        if (s == "logic") { lLOGIC.updateLength(MAX_PIXELS); for (int i=0;i<MAX_PIXELS;i++) lLOGIC.setPixelColor(i, lLOGIC.Color(60,60,60)); lLOGIC.show(); }
        Serial.printf("[LEDTEST] %s: every physical LED is lit dim white — COUNT them, then 'leds %s <count>'. 'ledtest off' when done.\n", s.c_str(), s.c_str());
      } else {
        Serial.println(F("[LEDTEST] usage: ledtest <psi|logic|hp|eye>  |  ledtest off"));
      }
    }
    if (cmdBuffer.startsWith("leds")) {
      local = true;
      String rest = cmdBuffer.substring(4); rest.trim();
      if (rest.length() == 0 || rest == "show") { ledsShow(); }
      else {
        int sp = rest.indexOf(' ');
        String strip = sp > 0 ? rest.substring(0, sp) : rest;
        int n = sp > 0 ? rest.substring(sp + 1).toInt() : -1;
        if (n < 1 || n > MAX_PIXELS) {
          Serial.printf("[LEDS] usage: leds <psi|logic|hp|eye> <1-%d>  |  leds show\n", MAX_PIXELS);
        } else {
          bool ok = true;
          if (strip == "psi") nPsi = n;
          else if (strip == "logic") nLogic = n;
          else if (strip == "hp") nHp = n;
          else if (strip == "eye") nEye = n;
          else { ok = false; Serial.println(F("[LEDS] strip must be psi | logic | hp | eye")); }
          if (ok) { ledTestActive = false; saveLedCounts(); applyLedCounts(); Serial.printf("[LEDS] %s = %d (saved)\n", strip.c_str(), n); ledsShow(); }
        }
      }
    }
    if (cmdBuffer == "help") {
      local = true;
      Serial.println("Dome-local: help, version, debug, setmac XX:.., web on|off");
      Serial.println("  leds <psi|logic|hp|eye> <n> | leds show   (per-strip pixel counts, saved)");
      Serial.println("  ledtest <psi|logic|hp|eye>                (light all LEDs on a circle to COUNT them; ledtest off)");
      Serial.println("Anything else is sent to the DRIVE over ESP-NOW; its console streams back here.");
    }
      // RC4.4: not a dome command -> tunnel it to the drive
      if (!local && rawLine.length()) sendTunnelCmd(rawLine);
      cmdBuffer = "";
    } else {
      cmdBuffer += c;
    }
    


