jlvandusen/Z-ClassControlSystem/firmware/ESP32_DOME_RC4/ESP32_DOME_RC4.ino
  }
}

void updateAnimations() {
  if (ledTestActive) return;   // 'ledtest' owns the LEDs while counting
  unsigned long currentMillis = millis();

  // RC4.7: a latched D-pad scene (4-7) fully owns all the LEDs. When it clears
  // (back to IDLE/tint), force a one-time repaint of the normal look.
  static bool sceneWasActive = false;
  if (currentAnim >= SCENE_ALERT) {
    renderScene(currentMillis);
    sceneWasActive = true;
    return;
  }
  if (sceneWasActive) {
    sceneWasActive = false;
    PSI.clear(); PSI.show();
    HP.fill(HP.Color(0, 0, 255)); HP.show();
    lastEyeUpdate = 0; lastLogicUpdate = 0;   // let eye + bars repaint next tick
  }

  // ---------------- PSI (RC4.5, per the reference video) ----------------
  // While a sound plays: WHITE, easing slowly up and down (0.6-1.2 s ramps,
  // short holds) with occasional fast flicker bursts in between. Not a
  // loop-rate shimmer, not a cylon sweep. PSI is OWNED here; the RED/BLUE/
  // RAINBOW pad anims paint it only when idle (and only on change).
  {
    static uint8_t  phase = 0;            // 0 up, 1 hold, 2 down, 3 dark, 4 flicker
    static float    level = 0;
    static uint16_t rampMs = 900;
    static unsigned long phaseAt = 0, tickAt = 0, flickAt = 0;
    static bool     flickOn = false, wasTalking = false;

    bool talking = (incoming.psi != 0) || (shouldFlicker && currentMillis <= flickerEndTime);

    // RC4.6: the psi field now carries the TRACK NUMBER (1..119; 255 =
    // playing-but-unknown). If we have that track's pre-computed amplitude
    // envelope, the PSI follows the actual beeps of the sound; otherwise
    // fall through to the generic speech-cadence engine below.
    static int envTrack = 0;
    static unsigned long envStartMs = 0;
    static uint8_t envLast = 255;
    if (talking && incoming.psi > 0 && incoming.psi < 120) {
      const PsiEnv *env = psiEnvFor((uint8_t)incoming.psi);
      if (env) {
        if (envTrack != incoming.psi) { envTrack = incoming.psi; envStartMs = currentMillis; envLast = 255; }
        uint16_t idx = (uint16_t)((currentMillis - envStartMs) / PSI_ENV_STEP_MS);
        uint8_t v = (idx < env->len) ? env->data[idx] : 0;   // past the end: dark
        if (v != envLast) {
          envLast = v;
          PSI.fill(PSI.Color(v, v, v));                      // WHITE, beep-synced
          PSI.show();
        }
        wasTalking = true;
        return;   // envelope owns the PSI this pass (skip the generic engine)
      }
    }
    if (!talking) envTrack = 0;

    if (talking) {
      wasTalking = true;
      if (currentMillis - tickAt >= 20) {           // 50 Hz easing tick
        tickAt = currentMillis;
        float step = 255.0f * 20.0f / rampMs;
        switch (phase) {
          case 0:  // ramp up
            level += step;
            if (level >= 255) { level = 255; phase = 1; phaseAt = currentMillis + random(80, 250); }
            break;
          case 1:  // bright hold -> sometimes a flicker burst
            if ((long)(currentMillis - phaseAt) >= 0) {
              if (random(0, 100) < 60) { phase = 4; phaseAt = currentMillis + random(250, 600); flickAt = 0; }
              else { phase = 2; rampMs = random(220, 500); }
            }
            break;
          case 2:  // ramp down
            level -= step;
            if (level <= 0) { level = 0; phase = 3; phaseAt = currentMillis + random(60, 200); }
            break;
          case 3:  // dark hold
            if ((long)(currentMillis - phaseAt) >= 0) { phase = 0; rampMs = random(220, 500); }
            break;
          case 4:  // fast flicker burst, then ease down
            if ((long)(currentMillis - flickAt) >= 0) {
              flickOn = !flickOn;
              level = flickOn ? 255 : 0;
              flickAt = currentMillis + random(40, 90);
            }
            if ((long)(currentMillis - phaseAt) >= 0) { phase = 2; level = 255; rampMs = random(220, 500); }
            break;
        }
        uint8_t v = (uint8_t)level;
        PSI.fill(PSI.Color(v, v, v));   // WHITE
        PSI.show();
      }
    } else {
      if (wasTalking) {                              // clean exit once
        wasTalking = false;
        shouldFlicker = false;
        phase = 0; level = 0;
        PSI.clear(); PSI.show();
      }
      // idle: pad anims may own the PSI (painted on change only)
      static AnimState shown = (AnimState)255;
      if (currentAnim != shown) {
        shown = currentAnim;
        switch (currentAnim) {
          case RED:  PSI.fill(PSI.Color(255, 0, 0)); PSI.show(); break;
          case BLUE: PSI.fill(PSI.Color(0, 0, 255)); PSI.show(); break;
          case RAINBOW: break;                       // handleAnimation cycles it
          default:   PSI.clear(); PSI.show(); break;
        }
      }
      if (currentAnim == RAINBOW) handleAnimation();
    }
  }

  // ---------------- Eye (unchanged: red while running) ----------------
  if (currentMillis - lastEyeUpdate > random(3000, 10000)) {
    EYE.fill(EYE.Color(random(50, 255), 0, 0));
    EYE.show();
    lastEyeUpdate = currentMillis;
  }

  // ---------------- Logic bars (RC4.5): slow BLUE scroll ----------------
  // A blue comet drifting along the bar (head bright, tail fading) - a calm
  // scroll, NOT a KITT/cylon bounce. Both bars run the same pattern offset.
  {
    static unsigned long scrollAt = 0;
    static uint8_t head = 0;
    if (currentMillis - scrollAt >= 160) {
      scrollAt = currentMillis;
      int lp = sLOGIC.numPixels();
      head = (head + 1) % lp;
      for (int i = 0; i < lp; i++) {
        int d = (head - i + lp) % lp;  // 0 = head
        uint8_t b = (d == 0) ? 255 : (d == 1 ? 90 : (d == 2 ? 25 : 0));
        sLOGIC.setPixelColor(i, sLOGIC.Color(0, 0, b));
        lLOGIC.setPixelColor((i + lp / 2) % lp, lLOGIC.Color(0, 0, b));
      }
      sLOGIC.show(); lLOGIC.show();
    }
  }

  // ---------------- HP: solid blue (say the word for red) ----------------
  {
    static bool hpPainted = false;
    if (!hpPainted) { hpPainted = true; HP.fill(HP.Color(0, 0, 255)); HP.show(); }
  }
}

void handleAnimation() {
  // RC4.5: only the rainbow needs a per-loop service now; RED/BLUE/IDLE are
  // painted on change inside updateAnimations() (the old version cleared the
  // PSI every loop pass and fought the talking flicker).
  if (currentAnim == RAINBOW) rainbowCycle();
}

// RC4.7: D-pad light scenes. Each fully owns eye + HP + PSI + both logic bars
// while latched; releasing the scene (IDLE) restores the normal look. Add a
// case here + an AnimState + a drive D-pad mapping to grow the set.
void renderScene(unsigned long ms) {
  switch (currentAnim) {

    case SCENE_ALERT: {              // UP — red alarm strobe, everything flashes
      static unsigned long at = 0; static bool on = false;
      if (ms - at >= 110) { at = ms; on = !on; }
      uint8_t v = on ? 255 : 12;
      EYE.fill(EYE.Color(v, 0, 0));
      PSI.fill(PSI.Color(v, 0, 0));
      HP.fill(HP.Color(v, 0, 0));
      sLOGIC.fill(sLOGIC.Color(v, 0, 0));
      lLOGIC.fill(lLOGIC.Color(v, 0, 0));
      break;
    }

    case SCENE_SCANNER: {            // DOWN — cyan KITT bounce on the logic bars
      static unsigned long at = 0; static int pos = 0; static int dir = 1;
      int n = sLOGIC.numPixels();
      if (ms - at >= 70) {
        at = ms; pos += dir;
        if (pos >= n - 1) { pos = n - 1; dir = -1; }
        else if (pos <= 0) { pos = 0; dir = 1; }
      }
      for (int i = 0; i < n; i++) {
        int d = abs(i - pos);
        uint8_t b = d == 0 ? 255 : (d == 1 ? 60 : 0);
        sLOGIC.setPixelColor(i, sLOGIC.Color(0, b, b));
        lLOGIC.setPixelColor(n - 1 - i, lLOGIC.Color(0, b, b));   // mirrored
      }
      EYE.fill(EYE.Color(0, 180, 200));
      HP.fill(HP.Color(0, 40, 60));
      PSI.fill(PSI.Color(0, 120, 140));
      break;
    }

    case SCENE_FIRE: {               // LEFT — warm flicker across every pixel
      static unsigned long at = 0;
      if (ms - at >= 60) {
        at = ms;
        auto ember = [](Adafruit_NeoPixel& s) {
          for (int i = 0; i < s.numPixels(); i++) {
            uint8_t r = random(160, 256), g = (uint8_t)((int)r * random(30, 90) / 255);
            s.setPixelColor(i, s.Color(r, g, 0));
          }
        };
        ember(EYE); ember(PSI); ember(HP); ember(sLOGIC); ember(lLOGIC);
      } else return;                  // hold last frame between flicker ticks
      break;
    }

