jlvandusen/Z-ClassControlSystem/firmware/ESP32_DOME_RC4/ESP32_DOME_RC4.ino
    case SCENE_PARTY: {              // RIGHT — fast rainbow across everything
      static unsigned long at = 0; static uint16_t hue = 0;
      if (ms - at >= 25) { at = ms; hue += 2200; }
      auto wash = [&](Adafruit_NeoPixel& s, uint16_t base) {
        int n = s.numPixels();
        for (int i = 0; i < n; i++)
          s.setPixelColor(i, s.gamma32(s.ColorHSV(base + (uint16_t)(i * (65536L / max(1, n))))));
      };
      wash(EYE, hue); wash(PSI, hue + 10000); wash(HP, hue + 20000);
      wash(sLOGIC, hue); wash(lLOGIC, hue + 30000);
      break;
    }

    default: return;
  }
  EYE.show(); PSI.show(); HP.show(); sLOGIC.show(); lLOGIC.show();
}


void rainbowCycle() {
  static uint16_t hue = 0;
  if (millis() - lastRainbowUpdate > 50) {
    PSI.fill(PSI.gamma32(PSI.ColorHSV(hue)));
    sLOGIC.fill(sLOGIC.gamma32(sLOGIC.ColorHSV(hue + 5000)));
    lLOGIC.fill(lLOGIC.gamma32(lLOGIC.ColorHSV(hue + 10000)));
    HP.fill(HP.gamma32(HP.ColorHSV(hue + 15000)));
    EYE.fill(EYE.gamma32(EYE.ColorHSV(hue + 20000)));
    PSI.show(); sLOGIC.show(); lLOGIC.show(); HP.show(); EYE.show();
    hue += 256;
    lastRainbowUpdate = millis();
  }
}


#if ESP_ARDUINO_VERSION_MAJOR >= 3
void OnDataRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  const uint8_t *mac = info->src_addr;
#else
void OnDataRecv(const uint8_t *mac, const uint8_t *data, int len) {
#endif
  // RC4.4: drive console stream -> straight out the USB port
  if (len == sizeof(TunnelOut)) {
    TunnelOut t;
    memcpy(&t, data, sizeof(t));
    if (t.type != TUNNEL_OUT_TYPE || t.len > sizeof(t.data)) return;
    if (tunnelSum(t) != t.checksum) return;
    Serial.write((const uint8_t *)t.data, t.len);
    webLogAppend(t.data, t.len);      // RC4.7: dashboard console view
    lastDataTime = millis();
    return;
  }
  if (len != sizeof(incoming)) return;
  memcpy(&incoming, data, sizeof(incoming));
  lastDataTime = millis();

  if (debugLocal) {
    Serial.println(F("[ESP-NOW] Received data from Drive:"));
    Serial.printf("  MAC: %02X:%02X:%02X:%02X:%02X:%02X\n",
                  mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    Serial.printf("  PSI Flicker: %s\n", incoming.psi ? "ON" : "OFF");
    Serial.printf("  Animation: %d\n", incoming.anim);
    Serial.printf("  Battery: %.2f V\n", incoming.bat);
    Serial.printf("  Checksum: 0x%04X\n", incoming.checksum);
    Serial.println(F("--------------------------------------------"));
  }

  // Flicker logic
  if (incoming.psi != 0 && !shouldFlicker) {
    shouldFlicker = true;
    flickerEndTime = millis() + random(1000, 3000);
  }

  // Update animation state
  switch(incoming.anim) {
    case 1: currentAnim = RAINBOW; break;
    case 2: currentAnim = RED; break;
    case 3: currentAnim = BLUE; break;
    case 4: currentAnim = SCENE_ALERT; break;
    case 5: currentAnim = SCENE_SCANNER; break;
    case 6: currentAnim = SCENE_FIRE; break;
    case 7: currentAnim = SCENE_PARTY; break;
    default: currentAnim = IDLE; break;
  }
}

#if ESP_ARDUINO_VERSION_MAJOR >= 3
void OnDataSent(const wifi_tx_info_t *tx_info, esp_now_send_status_t status) {
#else
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
#endif
  if (debugLocal) {
    Serial.printf("[SEND STATUS] %s\n", status == ESP_NOW_SEND_SUCCESS ? "Success" : "Fail");
  }
  // RC4.4: command packets retry until the MAC ACK lands. RC4.7: during an
  // OTA stream the chunk gets the ack routing first (it dominates traffic).
  if (gOtaAwaitAck) {
    gOtaAwaitAck = false;
    if (status != ESP_NOW_SEND_SUCCESS) gOtaResend = true;
  } else if (gTunAwaitAck) {
    gTunAwaitAck = false;
    if (status != ESP_NOW_SEND_SUCCESS) gTunResend = true;
  }
}

void sendBattery() {
  float voltage = readBatteryVoltage();
  outgoing.bat = voltage;
  outgoing.checksum = calculateChecksum(outgoing);
  esp_now_send(masterMAC, (uint8_t*)&outgoing, sizeof(outgoing));
  if (debugLocal) {
    Serial.printf("[SEND] Battery=%.2fV\n", voltage);
  }
}

float readBatteryVoltage() {
  int raw = analogRead(battPin);
  return (raw / 4095.0) * 3.3 * 2.0;
}

uint16_t calculateChecksum(const struct_message &d) {
  const uint8_t* p = (const uint8_t*)&d;
  uint16_t s = 0;
  for (size_t i = 0; i < sizeof(d) - sizeof(d.checksum); i++) {
    s += p[i];
  }
  return s;
}

void bootFeedback() {
  unsigned long start = millis();
  bool ledOn = false;
  while (millis() - start < 1200) {
    if ((millis() / 200) % 2 == 0 && !ledOn) {
      PSI.fill(PSI.Color(0, 255, 0));
      PSI.show();
      ledOn = true;
    } else if ((millis() / 200) % 2 == 1 && ledOn) {
      PSI.clear(); PSI.show();
      ledOn = false;
    }
  }
}

void showBuildInfoSerial(const char* prefix)
{
  Serial.print(prefix);
  Serial.print(" | ");
  Serial.print(DEFAULT_REVISION);
  Serial.print(F(" | build "));
  Serial.print(BB8_BUILD_NUM);
  Serial.print(F(" | "));
  Serial.print(F(BB8_BUILD_DATE));
  Serial.print(F(" | git "));
  Serial.println(F(BB8_BUILD_GIT));
}

